shipping_old/shipping/app/controllers/orders_controller.rb

INSERT INTO `addresses` (`address_line1`, `address_line2`, `city`, `country`, `created_at`, `state`, `updated_at`, `zipcode`) VALUES (NULL, NULL, NULL, NULL, '2013-09-12 06:02:07', NULL, '2013-09-12 06:02:07', NULL)
INSERT INTO `orders` (`created_at`, `destination_id`, `height`, `length`, `origin_id`, `shipping_price`, `updated_at`, `weight`, `width`) VALUES ('2013-09-12 06:18:18', 14, 5.0, 10.0, 13, 1071.0, '2013-09-12 06:18:18', 50.0, 5.0)
---
	def create
		# debugger
		 @order = Order.new
		 @sender_address = Address.new
		 @sender_address.city = params[:order][:origin][:city]
		 @sender_address.state = params[:order][:origin][:state]
		 @sender_address.zipcode = params[:order][:origin][:zipcode]
		 @sender_address.country = params[:order][:origin][:country]
		 @sender_address.save

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 5 LIMIT 1
---
	def edit
		 @order = Order.find(params[:id])